# Lux -> lux_sensor.log

## turn log into dataframe

In [5]:
import pandas as pd

log_data  = open('lux_Sensor.log', 'r', encoding='UTF-8')
split_list = []

for line in log_data:
    thing1 = line.split('\n')
    time = thing1[0][:17]
    lux = thing1[0][18:]
    split_list.append([time, lux])

In [6]:
raw_data = pd.DataFrame(split_list, columns=['time', 'lux'])

In [7]:
raw_data.head(5)

                time    lux
0  1574905580.311033  40.00
1  1574905581.430565  40.00
2  1574905582.495352  40.00
3  1574905583.541548  40.00
4  1574905584.583940  40.00

## split data

In [8]:
lux_data = raw_data[raw_data["time"].between("1574985600","1575676800")]

In [9]:
lux_data.head(5)

                    time     lux
61948  1574985600.455115  486.67
61949  1574985601.633635  486.67
61950  1574985602.666011  486.67
61951  1574985603.713621  486.67
61952  1574985604.761707  487.50

In [10]:
len(lux_data)

707002

## turn str into float and round

In [11]:
def trans_round_float(number):
    try:
        return round(float(number))
    except:
        return 0

In [14]:
lux_data.iloc[:,0] = list(map(trans_round_float, lux_data.iloc[:,0]))

lux_data.iloc[:,1] = list(map(trans_round_float, lux_data.iloc[:,1]))

In [15]:
type(lux_data.iloc[2,1])

numpy.int64

In [16]:
lux_data.head(5)

             time  lux
61948  1574985600  487
61949  1574985602  487
61950  1574985603  487
61951  1574985604  487
61952  1574985605  488

In [17]:
lux_data_new = lux_data.reset_index()

In [18]:
lux_data_new.head()

   index        time  lux
0  61948  1574985600  487
1  61949  1574985602  487
2  61950  1574985603  487
3  61951  1574985604  487
4  61952  1574985605  488

In [21]:
lux_data_new = lux_data_new.drop(['index'], axis=1)

In [26]:
lux_data_new.head()

              time  lux
0       1574985600  487
1       1574985602  487
2       1574985603  487
3       1574985604  487
4       1574985605  488
5       1574985606  488
6       1574985607  488
7       1574985608  488
8       1574985609  488
9       1574985610  488
10      1574985611  488
11      1574985612  488
12      1574985613  488
13      1574985614  488
14      1574985615  488
15      1574985616  488
16      1574985618  488
17      1574985619  488
18      1574985620  488
19      1574985621  488
20      1574985622  488
21      1574985623  488
22      1574985624  488
23      1574985625  488
24      1574985626  488
25      1574985627  488
26      1574985628  488
27      1574985629  489
28      1574985630  489
29      1574985631  489
...            ...  ...
706967  1575676782  638
706968  1575676783  640
706969  1575676783  640
706970  1575676784  641
706971  1575676784  641
706972  1575676785  642
706973  1575676785  642
706974  1575676786  643
706975  1575676786  643
706976  1575676787  645
706977  1575676787  645
706978  1575676788  646
706979  1575676788  646
706980  1575676789  648
706981  1575676789  648
706982  1575676790  648
706983  1575676790  648
706984  1575676791  650
706985  1575676791  650
706986  1575676792  651
706987  1575676792  651
706988  1575676793  652
706989  1575676793  652
706990  1575676794  653
706991  1575676794  653
706992  1575676795  655
706993  1575676795  655
706994  1575676796  656
706995  1575676796  656
706996  1575676797  658

[706997 rows x 2 columns]

In [24]:
lux_data_new.to_csv('lux_data_new.csv')

## timestamp_to_datetime

In [5]:
import time
from datetime import datetime
def timestamp_to_datetime(timestamp):
    """
    :param timestamp: 10未整數時間戳記 (1456402864242)
    :return: 返回 datetime 格式 {datetime}2016-02-25 20:21:04.242000
    """
    local_dt_time = datetime.fromtimestamp(timestamp / 1.0).strftime('%Y-%m-%d %H:%M:%S.%f')
    return local_dt_time

In [6]:
lux_data.iloc[-1,0]

1575881751

In [7]:
n = timestamp_to_datetime(lux_data.iloc[-1,0])
n

'2019-12-09 16:55:51.000000'

## split data

In [8]:
lux_data.iloc[-3:,:]

              time    lux
984786  1575881750  43.33
984787  1575881750  43.33
984788  1575881751  43.33

In [9]:
lux_data_new = lux_data.iloc[-200000:,:]
lux_data_new.to_csv('lux_data_new.csv')

## plot

In [10]:
len(lux_data)

984789

In [11]:
import matplotlib.pyplot as plt
import pandas as pd

f, ax = plt.subplots(figsize=(22, 6))
plt.scatter(lux_data.index,lux_data['lux'],color='red')
# plt.xlim(['2019-10-30 19:29:21','2019-11-26 12:30:17'])

# plt.legend()
plt.show()